//////////////////////////////////////////////////////////////
//ИНТЕРФЕЙС ШКАТУЛКИ
//////////////////////////////////////////////////////////////

casket_wsp_n1=^int_sr_t3^[spirit1]
casket_wsp_n2=^int_sr_t3^[spirit2]
casket_wsp_n3=^int_sr_t3^[spirit3]
casket_wsp_n4=^int_sr_t3^[spirit4]

wspl1=^int_sr_mm^Level [spirit_1level].<br>Experience: ^[spexp1]^([spmax1]).
wspl2=^int_sr_mm^Level [spirit_2level].<br>Experience: ^[spexp2]^([spmax2]).
wspl3=^int_sr_mm^Level [spirit_3level].<br>Experience: ^[spexp3]^([spmax3]).
wspl4=^int_sr_mm^Level [spirit_4level].<br>Experience: ^[spexp4]^([spmax4]).

casket_status_sleep_1=^spirit_tS^Status:<br>Rest: [sleep1]
casket_status_sleep_2=^spirit_tS^Status:<br>Rest: [sleep2]
casket_status_sleep_3=^spirit_tS^Status:<br>Rest: [sleep3]
casket_status_sleep_4=^spirit_tS^Status:<br>Rest: [sleep4]
casket_status_ready=^spirit_tS^Status:<br>Awaiting instructions.
casket_status_no_rage=^spirit_tS^Status:<br>Not enough Rage!
casket_status_offline=^spirit_tS^Status:<br>Inaccessible.
casket_status_wait=^spirit_tS^Status:<br>Waiting.

casket_close_hint=Close the Chest
cannt_use_spirits_in_boss_arenas=Dear gamer! You cannot summon Spirits of Rage when fighting bosses. We apologize for any inconvenience. Please send all complaints to Undead Control Administration, Bosses Combat Department, and apply for a revision of the Endorian combat regulations.

//////////////////////////////////////////////////////////////
//ТЕКСТА
//////////////////////////////////////////////////////////////
// куски для склейки в хинт
spirit_hint_level=Level
spirit_hint_damage=Damage:
spirit_hint_dam=Dam:
spirit_hint_abilitylevel=Ability Level: 
spirit_hint_rest=Rest: 
spirit_hint_rage=Rage: 
spirit_hint_combatexp=Combat Experience: 
spirit_hint_baseexp=Base Experience: 
spirit_hint_noexp=None
spirit_hint_health=Health:
spirit_hint_time=Lifetime:
spirit_hint_square=Area:
spirit_hint_poison=Poison strength:
spirit_hint_slow=Slow:
spirit_hint_disease=Weakness:
spirit_hint_kill=Kills:
spirit_hint_rage_capture=Draining:
spirit_hint_unit_level=Target's level:
spirit_hint_bleeding=Bleeding:
spirit_hint_stunning=Stunning:
spirit_hint_energo=Chargers:
spirit_hint_mana=Mana/Rage:
spirit_hint_attack=Attack:
spirit_hint_defense=Defense:
spirit_hint_orbdefense=Defense / Physical and Fire Resistance:
spirit_hint_orbdefres=Defense / Physical and Fire Resistance:
spirit_hint_res_all=Resist All:
spirit_hint_ap=AP:
spirit_hint_initiative=Initiative:
spirit_hint_init=Init:
spirit_rest_last=Remain:
spirit_heal=Healing:
spirit_dispellgood=Removes positive spells.
spirit_dispellbad=Removes harmful spells.
spirit_apally=Decreases AP of enemy.
spirit_apenemy=Increases AP of friendly troops.
spirit_hint_freeze=Freeze:
spirit_hint_thorns=Thorns:
spirit_hint_duration=Duration:
spirit_hint_fear=Fear:
spirit_hint_poisonC=Poison:

//////////////////////////////////////////////////////////////
//АТАКИ ДУХОВ
//////////////////////////////////////////////////////////////

// названия атак
sp_attack_lump=Smashing Sword
sp_attack_wall=Stone Wall
sp_attack_rockfall=Rockfall
sp_attack_quake=Underground Blades

sp_attack_spittle=Poisonous Spit
sp_attack_fishes=Evil Shoal
sp_attack_fog=Cloud of Poison
sp_attack_glot=Glot's Armor

sp_attack_enboxes=Chargers
sp_attack_orb=Ice Orb
sp_attack_devatron=Ice Thorns
sp_attack_gizmo=Gizmo

sp_attack_reaping=Soul Draining
sp_attack_rage_gain=Rage Draining
sp_attack_time_return=Time Back
sp_attack_black_hole=Black Hole

therock_hint_on=The Spirit of Rage is ready to fight!
therock_hint_off=Zerock refuses to serve you.
therock_dream_hint=The Spirit of Rage is resting.
therock_rage_hint=Not enough Rage for summoning.

slime_hint_on=The Spirit of Rage is ready to fight!
slime_hint_off=Sleem refuses to obey you!
slime_dream_hint=The Spirit of Rage is resting.
slime_rage_hint=Not enough Rage for summoning.

lina_hint_on=The Spirit of Rage is ready to fight!
lina_hint_off=Lina refuses to obey you!
lina_dream_hint=The Spirit of Rage is resting.
lina_rage_hint=Not enough Rage for summoning.
lina_no=No// есть или нет дополнительное свойство атаки
lina_yes=Yes// есть или нет дополнительное свойство атаки

death_hint_on=The Spirit of Rage is ready to fight!
death_hint_off=Reaper refuses to obey you!
death_dream_hint=The Spirit of Rage is resting.
death_rage_hint=Not enough rage for summoning.

sp_gizmo_heal=Emergency Structural Repair
sp_gizmo_apally=Adrenaline-Booster Beam
sp_gizmo_apenemy=Adrenaline-Depletion Beam
sp_gizmo_dispel=Dispel Ray
sp_gizmo_res=Emergency Re-Animation Beam
sp_gizmo_attack=Gamma-Destructor Ray

// therock
spirit_therock=Zerock
spmi_thr_lump=^spirit_tM^[menu][lump]
spmi_thr_lump_hdr=^spirit_tM^[caption][lump]
spmi_thr_lump_txt=^int_spr_tH0^Turns from stone to blade, and inflicts [damage] points of damage to the target as well as causing bleeding to the target for the specified duration. If the target is a mage or a tower, this damage is doubled. Bleeding targets suffer [s][bleeding]%[/s] decrease in Attack and Defense. [abilitylevel]<br>[TM]Duration: [d][duration] rounds[rest][rage][exp]

spmi_thr_wall=^spirit_tM^[menu][wall]
spmi_thr_wall_hdr=^spirit_tM^[caption][wall]
spmi_thr_wall_txt=^int_spr_tH0^Sets a Stone Wall on the battlefield, which will stand until it is destroyed or its lifetime expires. The Stone Wall is not affected by Spells or side effects of attacks (i.e. burning, poisoning, etc.). [abilitylevel]<br>[TM]Health: [d][health]<br>[TM]Defense: [d][defense]<br>[TM]Resist All: [d][res_all]%<br>[TM]Lifetime: [d][time] rounds[rest][rage][exp]

spmi_thr_rockfall=^spirit_tM^[menu][rockfall]
spmi_thr_rockfall_hdr=^spirit_tM^[caption][rockfall]
spmi_thr_rockfall_txt=^int_spr_tH0^Casts a shower of stone blades, inflicting [damage] points of damage to all enemy targets within the selected area with a possibility of stunning the target for the specified duration. Targeted mages and towers suffer double damage.[abilitylevel]<br>[TM]Chance to Stun: [d][stunning]%<br>[TM]Duration: [d][duration] rounds<br>[TM]Area: [d][square][rest][rage][exp]

spmi_thr_quake=^spirit_tM^[menu][quake]
spmi_thr_quake_hdr=^spirit_tM^[caption][quake]
spmi_thr_quake_txt=^int_spr_tH0^Shakes the battleground, summoning sharp stone blades, which inflict [damage] points of damage to enemy targets. Mages and towers suffer double damage. There is a [s][bleeding]%[/s] chance of causing bleeding to the target for the specified duration with a [s][bleeding]%[/s] decrease in Attack and Defense.[abilitylevel]<br>[TM]Duration: [d][duration] rounds[rest][rage][exp]

// slime 
spirit_slime=Sleem

spmi_thr_spittle=^spirit_tM^[menu][spittle]
spmi_thr_spittle_hdr=^spirit_tM^[caption][spittle]
spmi_thr_spittle_txt=^int_spr_tH0^Attacks the target with poisonous mucous, inflicting [damage] points of poison damage and poisoning the target for the specified duration. Poisoned targets inflict less damage and take poison damage each turn.[abilitylevel]<br>[TM]Poison Damage: [d][poison_min]-[poison_max]<br>[TM]Duration: [d][duration] rounds[rest][rage][exp]

spmi_thr_fishes=^spirit_tM^[menu][fishes]
spmi_thr_fishes_hdr=^spirit_tM^[caption][fishes]
spmi_thr_fishes_txt=^int_spr_tH0^Summons five large fish, which inflict [damage] points of damage to all targets in their path and have a chance to cause fear in the target (normal fear immunities apply) for the specified duration.[abilitylevel]<br>[TM]Chance of Fear: [d][fear]%<br>[TM]Duration: [d][duration] rounds[rest][rage][exp]

spmi_thr_fog=^spirit_tM^[menu][fog]
spmi_thr_fog_hdr=^spirit_tM^[caption][fog]
spmi_thr_fog_txt=^int_spr_tH0^Summons a Cloud of Poison, which moves through the battlefield in the direction of enemy targets. The Cloud of Poison inflicts [damage] points of poison damage to all targets enveloped by the cloud with a chance to poison the targets for the specified duration. Poisoned targets inflict less damage and take poison damage each turn.[abilitylevel]<br>[TM]Chance to Poison: [d][poison]%<br>[TM]Duration: [d][duration] rounds<br>[TM]Cloud Lifetime: [d][time2] rounds[rest][rage][exp]

spmi_thr_glot=^spirit_tM^[menu][glot]
spmi_thr_glot_hdr=^spirit_tM^[caption][glot]
spmi_thr_glot_txt=^int_spr_tH0^Surrounds a friendly troop with a magic field which absorbs all damage, is immune to all spells and effects, and protects the troop. However, this field does not allow the troop to move.[abilitylevel]<br>[TM]Takes damage: [d][health]<br>[TM]Resist All: [d][res_all]%<br>[TM]Lifetime: [d][duration] rounds[rest][rage][exp]

// lina
spirit_lina=Lina

spmi_thr_enboxes=^spirit_tM^[menu][enboxes]
spmi_thr_enboxes_hdr=^spirit_tM^[caption][enboxes]
spmi_thr_enboxes_txt=^int_spr_tH0^Sets several chargers on the battlefield, which give Mana and Rage to the hero. [TM]Note that the mana and rage increase is affected by the combat duration.[/s] Any troop which picks up a charger gains 1 Action Point (AP).[abilitylevel]<br>[TM]Chargers: [d][count]<br>[TM]Mana/Rage: [d][mana]/[erage][rest][rage][exp]

spmi_thr_orb=^spirit_tM^[menu][orb]
spmi_thr_orb_hdr=^spirit_tM^[caption][orb]
spmi_thr_orb_txt=^int_spr_tH0^Summons to the battlefield an Ice Ball, a powerful combat unit. When the Ice Ball lands, it shakes the ground and damages all wingless ground targets; structures (obstacles, barriers, and towers) receive double damage. For each hex a target is away from the landing point damage is decreased. Floating and winged targets suffer no damage. [abilitylevel]<br>[TM]Health: [d][health][TM][def]<br>[TM]Damage: [d][damage2][TM][atk][/s]<br>[TM]Roll Damage Increase / Hex: [d]+[k_dam]%<br>[TM]Impact Damage: [d][damageorbquake][/s]<br>[TM]Impact Damage Decrease / Hex: [d]-[k_dec]%[TM][init][rest][rage][exp]

spmi_thr_devatron=^spirit_tM^[menu][devatron]
spmi_thr_devatron_hdr=^spirit_tM^[caption][devatron]
spmi_thr_devatron_txt=^int_spr_tH0^Surrounds the area of 3 cells with fragile ice thorns that either damage enemy units or create barriers on the battlefied. Damaged enemies have a chance of being frozen. When attacked, the thorns return the percent of damage specified to the attacker. The thorns last for a random time up to the duration specified after which they explode doing area of effect damage equal to the thorn damage to all units - friend or foe![abilitylevel]<br>[TM]Damage: [d][damage2]<br>[TM]Chance to Freeze: [d][freeze]%<br>[TM]Thorns Damage: [d][thorns]%<br>[TM]Ice Thorn Max Duration: [d][duration] rounds[rest][rage][exp]

spmi_thr_gizmo=^spirit_tM^[menu][gizmo]
spmi_thr_gizmo_hdr=^spirit_tM^[caption][gizmo]
spmi_thr_gizmo_txt=^int_spr_tH0^Summons a mechanical creature onto the battlefield, which attacks enemy targets, heals and resurrects friendly troops, dispels magic, and alters the Action Points of friend and foe.[abilitylevel]<br>[TM]Healing / Resurrection: [d][heal]<br>[TM]Damage: [d][damage2]<br>[TM]Removes harmful effects: [d][dispell2]<br>[TM]Removes useful effects: [d][dispell1]<br>[TM]Decreases AP of enemy targets: [d][AP2]<br>[TM]Gives AP and double move to friendly targets: [d][AP1]<br>[TM]Attack / Resurrect Charges: [d][charges]<br>[TM]Action Points: [d][ap][TM][init][rest][rage][exp]

// death
spirit_death=Reaper

spmi_thr_reaping=^spirit_tM^[menu][reaping]
spmi_thr_reaping_hdr=^spirit_tM^[caption][reaping]
spmi_thr_reaping_txt=^int_spr_tH0^Drains the target's soul, killing [kill] of the warriors in the troop. Effects only living creatures. [abilitylevel][rest][rage][exp]

spmi_thr_rage_gain=^spirit_tM^[menu][rage_gain]
spmi_thr_rage_gain_hdr=^spirit_tM^[caption][rage_gain]
spmi_thr_rage_gain_txt=^int_spr_tH0^Inflicts [damage] points of astral damage, and drains the Rage of all enemy targets within the area of [s]19[/s] cells. [TM]Note that the rage increase is affected by the combat duration.[/s][abilitylevel]<br>[TM]Gives Rage: [d][gain][rest][rage][exp]

spmi_thr_time_return=^spirit_tM^[menu][time_return]
spmi_thr_time_return_hdr=^spirit_tM^[caption][time_return]
spmi_thr_time_return_txt=^int_spr_tH0^Returns the troop to the position which it occupied at the start of its [s]previous[/s] turn.[abilitylevel]<br>[TM]Target's maximum level: [d]1-[level][rest][rage][exp]

spmi_thr_black_hole=^spirit_tM^[menu][black_hole]
spmi_thr_black_hole_hdr=^spirit_tM^[caption][black_hole]
spmi_thr_black_hole_txt=^int_spr_tH0^Inflicts [damage] points of astral damage to all enemy targets. The higher the level of the enemy target, the greater the damage that the target will take.[abilitylevel][rest][rage][exp]

// interface labels

//wsp_color_text=,255,243,179,255,0,0 // color Rnorm,Gnorm,Bnorm,Rdisabl,Gdisabl,Bdisabl
//wsp_color_num=,255,180,0,255,0,0 // color Rnorm,Gnorm,Bnorm,Rdisabl,Gdisabl,Bdisabl

wsp_a1=^int_spr_t2^[par] 
wsp_a2=^int_spr_t2^[par] 
wsp_a3=^int_spr_t2^[par] 
wsp_a4=^int_spr_t2^[par] 
wsp_a5=^int_spr_t2^[par] 

wsp_fury1=^int_spr_t3^[par]
wsp_fury2=^int_spr_t3^[par]
wsp_fury3=^int_spr_t3^[par]
wsp_fury4=^int_spr_t3^[par]

wsp_fury_info1=^int_spr_t4^[Trage] ^[rage]
wsp_fury_info2=^int_spr_t4^[Trage] ^[rage]
wsp_fury_info3=^int_spr_t4^[Trage] ^[rage]
wsp_fury_info4=^int_spr_t4^[Trage] ^[rage]


wsp_rest1=^int_spr_t4^[Trest] ^[rest]
wsp_rest2=^int_spr_t4^[Trest] ^[rest]
wsp_rest3=^int_spr_t4^[Trest] ^[rest]
wsp_rest4=^int_spr_t4^[Trest] ^[rest]

//wsp_name=^int_spr_t5^Дух Ярости^ [name] NeedDelete
//wsp_level=^int_spr_t6^Уровень ^[level] NeedDelete
//wsp_exp=^int_spr_t7^Exp. [exp]/^[maxexp] NeedDelete
//wsp_exp_num=^int_spr_t8^[exp]
//wsp_attack=^int_spr_t8^Attack NeedDelete
//wsp_attack_num=^int_spr_t8^[attack]
//wsp_abilities=^int_spr_t9^Abilities NeedDelete
//wsp_rage=^int_spr_t9^[rage]
//wsp_rest=^int_spr_t9^[rest]

time_return_err1=It is impossible to return the troop, because it did not move.
time_return_err2=It is impossible to return the troop, because its previous position is now occupied.


// ПРОКАЧКА
lvu_spirit_level=^int_vld_tl^Level
lvu_spirit_level_num=^int_vld_num^[sp_level]
lvu_spirit_impr=^int_vld_t0^Select a special attack to upgrade:
lvu_spirit_left_strike=^int_spr_LUCap_t^[left_caption]
lvu_spirit_right_strike=^int_spr_LUCap_t^[right_caption]
//lvu_spirit_left_strike_type=^int_spr_LUBut_t^[left_type]
//lvu_spirit_right_strike_type=^int_spr_LUBut_t^[right_type]
lvu_spirit_left_strike_info=^int_spr_LUBut_t^[left_info]
lvu_spirit_right_strike_info=^int_spr_LUBut_t^[right_info]
lvu_spirit_get=^int_spr_LUCap_t^The Spirit of Rage [name] has gained a new level!

lvu_type_rage=Decrease cost of summoning
lvu_type_damage=Increase damage
lvu_type_rest=Rapid recovery
lvu_type_health=Increase health
lvu_type_time=Increase lifetime
lvu_type_square=Increase affected area
lvu_type_poison=Intense poisoning
lvu_type_slow=Intense slowing
lvu_type_rage_capture=Intense inflow of Rage
lvu_type_unit_level=Wider range of targets
lvu_type_kill=Increase attack power
lvu_type_heal=Increase healing
lvu_type_energo=More chargers
lvu_type_mana=Increase chargers' power
lvu_type_attack=Increase attack abilities
lvu_type_defense=Increase defense abilities
lvu_type_new=New ability!

//therock
//lump
lvu_lump_name=^spirit_tM^[lump]

lvu_lump_level1_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. Bleeding: [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_lump_level2_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [bleeding] [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_lump_level3_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [bleeding] [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_lump_level4_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [bleeding] [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_lump_level5_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [bleeding] [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_lump_level6_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [bleeding] [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_lump_level7_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [bleeding] [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_lump_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_lump_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_lump_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_lump_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]

lvu_wall_name=^spirit_tM^[wall]
lvu_wall_level1_info=^int_spr_LvlUp_tAD^[new]Stone Wall 3 cells long. Can be destroyed. <br>[d][health] [s][healthNew][/s]. [d][defense] [s][defenseNew][/s]. [d][res_all] [s][res_allNew]%[/s]. [time] [s][time2New][/s].
lvu_wall_level2_info=^int_spr_LvlUp_tAD^[healthCap][health] [healthNew]. [defense] [defenseNew]. [res_all] [res_allNew]%. [rest] [restNew]. [rage] [rageNew]^[health] [healthOld]. [defense] [defenseOld]. [res_all] [res_allOld]%. [rest] [restOld]. [rage] [rageOld]
lvu_wall_level3_info=^int_spr_LvlUp_tAD^[healthCap][health] [healthNew]. [defense] [defenseNew]. [res_all] [res_allNew]%. [rest] [restNew]. [rage] [rageNew]^[health] [healthOld]. [defense] [defenseOld]. [res_all] [res_allOld]%. [rest] [restOld]. [rage] [rageOld]
lvu_wall_level4_info=^int_spr_LvlUp_tAD^[healthCap][health] [healthNew]. [defense] [defenseNew]. [res_all] [res_allNew]%. [rest] [restNew]. [rage] [rageNew]^[health] [healthOld]. [defense] [defenseOld]. [res_all] [res_allOld]%. [rest] [restOld]. [rage] [rageOld]
lvu_wall_level5_info=^int_spr_LvlUp_tAD^[healthCap][health] [healthNew]. [defense] [defenseNew]. [res_all] [res_allNew]%. [rest] [restNew]. [rage] [rageNew]^[health] [healthOld]. [defense] [defenseOld]. [res_all] [res_allOld]%. [rest] [restOld]. [rage] [rageOld]
lvu_wall_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_wall_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_wall_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_wall_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_wall_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_wall_ttl1_info=^int_spr_LvlUp_tAD^[timeCap][time] [time2New]. [rest] [restNew]. [rage] [rageNew]^[time] [time2Old]. [rest] [restOld]. [rage] [rageOld]
lvu_wall_ttl2_info=^int_spr_LvlUp_tAD^[timeCap][time] [time2New]. [rest] [restNew]. [rage] [rageNew]^[time] [time2Old]. [rest] [restOld]. [rage] [rageOld]

//rockfall
lvu_rockfall_name=^spirit_tM^[rockfall]
lvu_rockfall_level1_info=^int_spr_LvlUp_tAD^[new]The shower of blades inflicts damage to enemy targets within the selected area.<br>[d][damage] [s][dmgFMinNew]-[dmgFMaxNew][/s]. [square] [s][squareNew][/s]. [d][stunning] [s][stunningNew]%[/s]. [d][duration] [s][durationNew][/s].
lvu_rockfall_level2_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [stunning] [stunningNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [stunning] [stunningOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rockfall_level3_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [stunning] [stunningNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [stunning] [stunningOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rockfall_level4_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [stunning] [stunningNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [stunning] [stunningOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rockfall_level5_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [stunning] [stunningNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [stunning] [stunningOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rockfall_level6_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [stunning] [stunningNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [stunning] [stunningOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rockfall_level7_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [stunning] [stunningNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [stunning] [stunningOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rockfall_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_rockfall_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_rockfall_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_rockfall_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_rockfall_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_rockfall_square1_info=^int_spr_LvlUp_tAD^[squareCap][square] [squareNew]. [rest] [restNew]. [rage] [rageNew]^[square] [squareOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rockfall_square2_info=^int_spr_LvlUp_tAD^[squareCap][square] [squareNew]. [rest] [restNew]. [rage] [rageNew]^[square] [squareOld]. [rest] [restOld]. [rage] [rageOld]

//quake
lvu_quake_name=^spirit_tM^[quake]
lvu_quake_level1_info=^int_spr_LvlUp_tAD^[new]Blades inflict damage to all enemy targets on the battlefield.<br>[d][damage] [s][dmgFMinNew]-[dmgFMaxNew][/s]. [d][bleeding] [s][bleedingNew]%[/s]. [d][duration] [s][durationNew][/s].
lvu_quake_level2_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [bleeding] [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_quake_level3_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [bleeding] [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_quake_level4_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [bleeding] [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_quake_level5_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [bleeding] [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_quake_level6_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [bleeding] [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_quake_level7_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [bleeding] [bleedingNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [bleeding] [bleedingOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_quake_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_quake_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_quake_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_quake_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_quake_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_quake_rest4_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]

//slim
lvu_spittle_name=^spirit_tM^[spittle]
lvu_spittle_level1_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgPMinNew]-[dmgPMaxNew]. [poison] [pMinNew]-[pMaxNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgPMinOld]-[dmgPMaxOld]. [poison] [pMinOld]-[pMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_spittle_level2_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgPMinNew]-[dmgPMaxNew]. [poison] [pMinNew]-[pMaxNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgPMinOld]-[dmgPMaxOld]. [poison] [pMinOld]-[pMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_spittle_level3_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgPMinNew]-[dmgPMaxNew]. [poison] [pMinNew]-[pMaxNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgPMinOld]-[dmgPMaxOld]. [poison] [pMinOld]-[pMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_spittle_level4_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgPMinNew]-[dmgPMaxNew]. [poison] [pMinNew]-[pMaxNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgPMinOld]-[dmgPMaxOld]. [poison] [pMinOld]-[pMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_spittle_level5_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgPMinNew]-[dmgPMaxNew]. [poison] [pMinNew]-[pMaxNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgPMinOld]-[dmgPMaxOld]. [poison] [pMinOld]-[pMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_spittle_level6_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgPMinNew]-[dmgPMaxNew]. [poison] [pMinNew]-[pMaxNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgPMinOld]-[dmgPMaxOld]. [poison] [pMinOld]-[pMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_spittle_level7_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgPMinNew]-[dmgPMaxNew]. [poison] [pMinNew]-[pMaxNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgPMinOld]-[dmgPMaxOld]. [poison] [pMinOld]-[pMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_spittle_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_spittle_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_spittle_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_spittle_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_spittle_poison1_info=^int_spr_LvlUp_tAD^[poisonCap][poison] [pMinNew]-[pMaxNew]. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[poison] [pMinOld]-[pMaxOld]. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_spittle_poison2_info=^int_spr_LvlUp_tAD^[poisonCap][poison] [pMinNew]-[pMaxNew]. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[poison] [pMinOld]-[pMaxOld]. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]

lvu_fishes_name=^spirit_tM^[fishes]
lvu_fishes_level1_info=^int_spr_LvlUp_tAD^[new]The predatory fish bite all enemy targets in their path.<br>[d][damage] [s][dmgFMinNew]-[dmgFMaxNew][/s]. [d][fear] [s][fearNew]%[/s]. [d][duration] [s][durationNew][/s].
lvu_fishes_level2_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [fear] [fearNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [fear] [fearOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_fishes_level3_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [fear] [fearNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [fear] [fearOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_fishes_level4_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [fear] [fearNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [fear] [fearOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_fishes_level5_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [fear] [fearNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [fear] [fearOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_fishes_level6_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [fear] [fearNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [fear] [fearOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_fishes_level7_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [fear] [fearNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [fear] [fearOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_fishes_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_fishes_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_fishes_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_fishes_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_fishes_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]

lvu_fog_name=^spirit_tM^[fog]
lvu_fog_level1_info=^int_spr_LvlUp_tAD^[new]Cloud of Poison inflicts damage to all targets enveloped by the cloud.<br>[d][damage] [s][dmgFogMinNew]-[dmgFogMaxNew][/s]. [d][poisonC] [s][poisonNew]%[/s]. [d][duration] [s][durationNew][/s].
lvu_fog_level2_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFogMinNew]-[dmgFogMaxNew]. [poisonC] [poisonNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFogMinOld]-[dmgFogMaxOld]. [poisonC] [poisonOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_fog_level3_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFogMinNew]-[dmgFogMaxNew]. [poisonC] [poisonNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFogMinOld]-[dmgFogMaxOld]. [poisonC] [poisonOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_fog_level4_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFogMinNew]-[dmgFogMaxNew]. [poisonC] [poisonNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFogMinOld]-[dmgFogMaxOld]. [poisonC] [poisonOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_fog_level5_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFogMinNew]-[dmgFogMaxNew]. [poisonC] [poisonNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFogMinOld]-[dmgFogMaxOld]. [poisonC] [poisonOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_fog_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_fog_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_fog_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_fog_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_fog_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_fog_time1_info=^int_spr_LvlUp_tAD^[timeCap][time] [timeNew]. [rage] [rageNew]^[time] [timeOld]. [rage] [rageOld]
lvu_fog_time2_info=^int_spr_LvlUp_tAD^[timeCap][time] [timeNew]. [rage] [rageNew]^[time] [timeOld]. [rage] [rageOld]

lvu_glot_name=^spirit_tM^[glot]
lvu_glot_level1_info=^int_spr_LvlUp_tAD^[new]Surrounds the troop with a magic field, which absorbs all damage and protects the troop.<br>[d][health] [s][healthNew][/s]. [d][res_all] [s][res_allNew]%[/s]. [d][duration] [s][durationNew][/s].
lvu_glot_level2_info=^int_spr_LvlUp_tAD^[healthCap][health] [healthNew]. [res_all] [res_allNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[health] [healthOld]. [res_all] [res_allOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_glot_level3_info=^int_spr_LvlUp_tAD^[healthCap][health] [healthNew]. [res_all] [res_allNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[health] [healthOld]. [res_all] [res_allOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_glot_level4_info=^int_spr_LvlUp_tAD^[healthCap][health] [healthNew]. [res_all] [res_allNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[health] [healthOld]. [res_all] [res_allOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_glot_level5_info=^int_spr_LvlUp_tAD^[healthCap][health] [healthNew]. [res_all] [res_allNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[health] [healthOld]. [res_all] [res_allOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_glot_level6_info=^int_spr_LvlUp_tAD^[healthCap][health] [healthNew]. [res_all] [res_allNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[health] [healthOld]. [res_all] [res_allOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_glot_level7_info=^int_spr_LvlUp_tAD^[healthCap][health] [healthNew]. [res_all] [res_allNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[health] [healthOld]. [res_all] [res_allOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld]
lvu_glot_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_glot_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_glot_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_glot_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_glot_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_glot_rest4_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]

// reaper
lvu_reaping_name=^spirit_tM^[reaping]
lvu_reaping_level1_info=^int_spr_LvlUp_tAD^
lvu_reaping_level2_info=^int_spr_LvlUp_tAD^[killCap][kill] [killNew]%. [rest] [restNew]. [rage] [rageNew]^[kill] [killOld]%. [rest] [restOld]. [rage] [rageOld]
lvu_reaping_level3_info=^int_spr_LvlUp_tAD^[killCap][kill] [killNew]%. [rest] [restNew]. [rage] [rageNew]^[kill] [killOld]%. [rest] [restOld]. [rage] [rageOld]
lvu_reaping_level4_info=^int_spr_LvlUp_tAD^[killCap][kill] [killNew]%. [rest] [restNew]. [rage] [rageNew]^[kill] [killOld]%. [rest] [restOld]. [rage] [rageOld]
lvu_reaping_level5_info=^int_spr_LvlUp_tAD^[killCap][kill] [killNew]%. [rest] [restNew]. [rage] [rageNew]^[kill] [killOld]%. [rest] [restOld]. [rage] [rageOld]
lvu_reaping_level6_info=^int_spr_LvlUp_tAD^[killCap][kill] [killNew]%. [rest] [restNew]. [rage] [rageNew]^[kill] [killOld]%. [rest] [restOld]. [rage] [rageOld]
lvu_reaping_level7_info=^int_spr_LvlUp_tAD^[killCap][kill] [killNew]%. [rest] [restNew]. [rage] [rageNew]^[kill] [killOld]%. [rest] [restOld]. [rage] [rageOld]
lvu_reaping_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_reaping_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_reaping_rage3_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_reaping_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_reaping_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_reaping_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_reaping_rest4_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]

//rage_gain
lvu_rage_gain_name=^spirit_tM^[rage_gain]
lvu_rage_gain_level1_info=^int_spr_LvlUp_tAD^[new]Inflicts damage to enemy targets, and drains their Rage.<br>[d][damage] [s][dmgAMinNew]-[dmgAMaxNew][/s]. [rage_capture] [s][capRageNew][/s].
lvu_rage_gain_level2_info=^int_spr_LvlUp_tAD^[rage_captureCap][damage] [dmgAMinNew]-[dmgAMaxNew]. [rage_capture] [capRageNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgAMinOld]-[dmgAMaxOld]. [rage_capture] [capRageOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rage_gain_level3_info=^int_spr_LvlUp_tAD^[rage_captureCap][damage] [dmgAMinNew]-[dmgAMaxNew]. [rage_capture] [capRageNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgAMinOld]-[dmgAMaxOld]. [rage_capture] [capRageOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rage_gain_level4_info=^int_spr_LvlUp_tAD^[rage_captureCap][damage] [dmgAMinNew]-[dmgAMaxNew]. [rage_capture] [capRageNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgAMinOld]-[dmgAMaxOld]. [rage_capture] [capRageOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rage_gain_level5_info=^int_spr_LvlUp_tAD^[rage_captureCap][damage] [dmgAMinNew]-[dmgAMaxNew]. [rage_capture] [capRageNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgAMinOld]-[dmgAMaxOld]. [rage_capture] [capRageOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rage_gain_level6_info=^int_spr_LvlUp_tAD^[rage_captureCap][damage] [dmgAMinNew]-[dmgAMaxNew]. [rage_capture] [capRageNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgAMinOld]-[dmgAMaxOld]. [rage_capture] [capRageOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rage_gain_level7_info=^int_spr_LvlUp_tAD^[rage_captureCap][damage] [dmgAMinNew]-[dmgAMaxNew]. [rage_capture] [capRageNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgAMinOld]-[dmgAMaxOld]. [rage_capture] [capRageOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rage_gain_level8_info=^int_spr_LvlUp_tAD^[rage_captureCap][damage] [dmgAMinNew]-[dmgAMaxNew]. [rage_capture] [capRageNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgAMinOld]-[dmgAMaxOld]. [rage_capture] [capRageOld]. [rest] [restOld]. [rage] [rageOld]
lvu_rage_gain_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_rage_gain_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_rage_gain_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_rage_gain_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_rage_gain_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_rage_gain_rest4_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]

lvu_time_return_name=^spirit_tM^[time_return]
lvu_time_return_level1_info=^int_spr_LvlUp_tAD^[new]Returns the selected troop back to its previous position.<br>[d][level] [s][levelNew][/s].
lvu_time_return_level2_info=^int_spr_LvlUp_tAD^[unit_levelCap][level] 1-[levelNew]. [rest] [restNew]. [rage] [rageNew]^[level] [levelOld]. [rest] [restOld]. [rage] [rageOld]
lvu_time_return_level3_info=^int_spr_LvlUp_tAD^[unit_levelCap][level] 1-[levelNew]. [rest] [restNew]. [rage] [rageNew]^[level] 1-[levelOld]. [rest] [restOld]. [rage] [rageOld]
lvu_time_return_level4_info=^int_spr_LvlUp_tAD^[unit_levelCap][level] 1-[levelNew]. [rest] [restNew]. [rage] [rageNew]^[level] 1-[levelOld]. [rest] [restOld]. [rage] [rageOld]
lvu_time_return_level5_info=^int_spr_LvlUp_tAD^[unit_levelCap][level] 1-[levelNew]. [rest] [restNew]. [rage] [rageNew]^[level] 1-[levelOld]. [rest] [restOld]. [rage] [rageOld]
lvu_time_return_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_time_return_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_time_return_rage3_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_time_return_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_time_return_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_time_return_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
//lvu_time_return_rest4_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]

//black_hole
lvu_black_hole_name=^spirit_tM^[black_hole]
lvu_black_hole_level1_info=^int_spr_LvlUp_tAD^[new]Inflicts great astral damage to all enemy targets.<br>[d][damage] [s][dmgAMinNew]-[dmgAMaxNew][/s].
lvu_black_hole_level2_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgAMinNew]-[dmgAMaxNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgAMinOld]-[dmgAMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_black_hole_level3_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgAMinNew]-[dmgAMaxNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgAMinOld]-[dmgAMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_black_hole_level4_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgAMinNew]-[dmgAMaxNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgAMinOld]-[dmgAMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_black_hole_level5_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgAMinNew]-[dmgAMaxNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgAMinOld]-[dmgAMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_black_hole_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_black_hole_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_black_hole_rage3_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_black_hole_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_black_hole_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_black_hole_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
//lvu_black_hole_rest4_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]

// lina
// energo
lvu_enboxes_name=^spirit_tM^[enboxes]
lvu_enboxes_level1_info=^int_spr_LvlUp_tAD^
lvu_enboxes_level2_info=^int_spr_LvlUp_tAD^[energoCap][energo] [countNew]. [rest] [restNew]. [rage] [rageNew]^[energo] [countOld]. [rest] [restOld]. [rage] [rageOld]
lvu_enboxes_level3_info=^int_spr_LvlUp_tAD^[energoCap][energo] [countNew]. [rest] [restNew]. [rage] [rageNew]^[energo] [countOld]. [rest] [restOld]. [rage] [rageOld]
lvu_enboxes_level4_info=^int_spr_LvlUp_tAD^[energoCap][energo] [countNew]. [rest] [restNew]. [rage] [rageNew]^[energo] [countOld]. [rest] [restOld]. [rage] [rageOld]
lvu_enboxes_level5_info=^int_spr_LvlUp_tAD^[energoCap][energo] [countNew]. [rest] [restNew]. [rage] [rageNew]^[energo] [countOld]. [rest] [restOld]. [rage] [rageOld]
lvu_enboxes_rage1_info=^int_spr_LvlUp_tAD^[manaCap][mana] [manaMinNew]-[manaMaxNew]/[rageMinNew]-[rageMaxNew]. [rest] [restNew]. [rage] [rageNew]^[mana] [manaMinOld]-[manaMaxOld]/[rageMinOld]-[rageMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_enboxes_rage2_info=^int_spr_LvlUp_tAD^[manaCap][mana] [manaMinNew]-[manaMaxNew]/[rageMinNew]-[rageMaxNew]. [rest] [restNew]. [rage] [rageNew]^[mana] [manaMinOld]-[manaMaxOld]/[rageMinOld]-[rageMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_enboxes_rage3_info=^int_spr_LvlUp_tAD^[manaCap][mana] [manaMinNew]-[manaMaxNew]/[rageMinNew]-[rageMaxNew]. [rest] [restNew]. [rage] [rageNew]^[mana] [manaMinOld]-[manaMaxOld]/[rageMinOld]-[rageMaxOld]. [rest] [restOld]. [rage] [rageOld]
lvu_enboxes_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_enboxes_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]

// orb 
lvu_orb_name=^spirit_tM^[orb]
lvu_orb_level1_info=^int_spr_LvlUp_tAD^[new]Summons an Ice Ball to the battlefield.<br>[d][health] [s][healthNew][/s]. [damage] [s][dmgFMinNew]-[dmgFMaxNew] (+[k_damNew]% per hex Rolling Damage / Impact Damage (ID) 2x: -[k_decNew]% damage per hex from impact cell)[/s] [init] [s]+[initNew][/s]
lvu_orb_attack1_info=^int_spr_LvlUp_tAD^[attackCap][dam] [dmgFMinNew]-[dmgFMaxNew] (+[k_damNew]%/hex / -[k_decNew]%/hex). [attack] +[atkNew]. [init] +[initNew]. [rest] [restNew]. [rage] [rageNew]^[dam] [dmgFMinOld]-[dmgFMaxOld] (+[k_damOld]%/hex / -[k_decOld]%/hex). [init] +[initOld]. [rest] [restOld]. [rage] [rageOld]
lvu_orb_attack2_info=^int_spr_LvlUp_tAD^[attackCap][dam] [dmgFMinNew]-[dmgFMaxNew] (+[k_damNew]%/hex / -[k_decNew]%/hex). [attack] +[atkNew]. [init] +[initNew]. [rest] [restNew]. [rage] [rageNew]^[dam] [dmgFMinOld]-[dmgFMaxOld] (+[k_damOld]%/hex / -[k_decOld]%/hex). [attack] +[atkOld]. [init] +[initOld]. [rest] [restOld]. [rage] [rageOld]
lvu_orb_attack3_info=^int_spr_LvlUp_tAD^[attackCap][dam] [dmgFMinNew]-[dmgFMaxNew] (+[k_damNew]%/hex / -[k_decNew]%/hex). [attack] +[atkNew]. [init] +[initNew]. [rest] [restNew]. [rage] [rageNew]^[dam] [dmgFMinOld]-[dmgFMaxOld] (+[k_damOld]%/hex / -[k_decOld]%/hex). [attack] +[atkOld]. [init] +[initOld]. [rest] [restOld]. [rage] [rageOld]
lvu_orb_defense1_info=^int_spr_LvlUp_tAD^[defenseCap][health] [healthNew]. [orbdefres] +[defNew]. [rest] [restNew]. [rage] [rageNew]^ [health] [healthOld]. [rest] [restOld]. [rage] [rageOld]
lvu_orb_defense2_info=^int_spr_LvlUp_tAD^[defenseCap][health] [healthNew]. [orbdefres] +[defNew]. [rest] [restNew]. [rage] [rageNew]^ [health] [healthOld]. [orbdefres] +[defOld]. [rest] [restOld]. [rage] [rageOld]
lvu_orb_defense3_info=^int_spr_LvlUp_tAD^[defenseCap][health] [healthNew]. [orbdefres] +[defNew]. [rest] [restNew]. [rage] [rageNew]^ [health] [healthOld]. [orbdefres] +[defOld]. [rest] [restOld]. [rage] [rageOld]
lvu_orb_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_orb_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_orb_rage3_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_orb_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_orb_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_orb_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_orb_rest4_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]

//devatron
lvu_devatron_name=^spirit_tM^[devatron]
lvu_devatron_level1_info=^int_spr_LvlUp_tAD^[new]Surrounds the area of 3 cells with fragile ice thorns that block and damage enemies.<br>[d][damage] [s][dmgFMinNew]-[dmgFMaxNew][/s]. [freeze] [s][freezeNew]%[/s]. [thorns] [s][thornsNew]%[/s]. [duration] [s][durationNew][/s].
lvu_devatron_level2_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [freeze] [freezeNew]%. [thorns] [thornsNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [freeze] [freezeOld]%. [thorns] [thornsOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld].
lvu_devatron_level3_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [freeze] [freezeNew]%. [thorns] [thornsNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [freeze] [freezeOld]%. [thorns] [thornsOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld].
lvu_devatron_level4_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [freeze] [freezeNew]%. [thorns] [thornsNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [freeze] [freezeOld]%. [thorns] [thornsOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld].
lvu_devatron_level5_info=^int_spr_LvlUp_tAD^[damageCap][damage] [dmgFMinNew]-[dmgFMaxNew]. [freeze] [freezeNew]%. [thorns] [thornsNew]%. [duration] [durationNew]. [rest] [restNew]. [rage] [rageNew]^[damage] [dmgFMinOld]-[dmgFMaxOld]. [freeze] [freezeOld]%. [thorns] [thornsOld]%. [duration] [durationOld]. [rest] [restOld]. [rage] [rageOld].
lvu_devatron_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rest] [restNew]. [rage] [rageNew]^[rest] [restOld]. [rage] [rageOld]
lvu_devatron_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rest] [restNew]. [rage] [rageNew]^[rest] [restOld]. [rage] [rageOld]
lvu_devatron_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_devatron_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_devatron_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]

// gizmo 
lvu_gizmo_name=^spirit_tM^[gizmo]
lvu_gizmo_level1_info=^int_spr_LvlUp_tAD^[new]Summons to the battlefield a mechanical guard which has the ability to heal and attack.
lvu_gizmo_attack1_info=^int_spr_LvlUp_tAD^[attackCap][dam] [dmgDMinNew]-[dmgDMaxNew]. [heal] [healNew]. Charges: [chargesNew]. [Init] +[initNew]. [rest] [restNew]. [rage] [rageNew]^[dam] [dmgDMinOld]-[dmgDMaxOld]. [heal] [healOld]. Charges: [chargesOld]. [Init] +[initOld]. [rest] [restOld]. [rage] [rageOld]
lvu_gizmo_attack2_info=^int_spr_LvlUp_tAD^[attackCap][dam] [dmgDMinNew]-[dmgDMaxNew]. [heal] [healNew]. Charges: [chargesNew]. [ap] [apNew]. [rest] [restNew]. [rage] [rageNew]^[dam] [dmgDMinOld]-[dmgDMaxOld]. [heal] [healOld]. Charges: [chargesOld]. [ap] [apOld]. [rest] [restOld]. [rage] [rageOld]
lvu_gizmo_attack3_info=^int_spr_LvlUp_tAD^[attackCap][dam] [dmgDMinNew]-[dmgDMaxNew]. [heal] [healNew]. Charges: [chargesNew]. [Init] +[initNew]. [rest] [restNew]. [rage] [rageNew]^[dam] [dmgDMinOld]-[dmgDMaxOld]. [heal] [healOld]. Charges: [chargesOld]. [Init] +[initOld]. [rest] [restOld]. [rage] [rageOld]
lvu_gizmo_attack4_info=^int_spr_LvlUp_tAD^[attackCap][dam] [dmgDMinNew]-[dmgDMaxNew]. [heal] [healNew]. Charges: [chargesNew]. [ap] [apNew]. [rest] [restNew]. [rage] [rageNew]^[dam] [dmgDMinOld]-[dmgDMaxOld]. [heal] [healOld]. Charges: [chargesOld]. [ap] [apOld]. [rest] [restOld]. [rage] [rageOld]
lvu_gizmo_healing1_info=^int_spr_LvlUp_tAD^[healCap][heal] [healNew]. [dam] [dmgDMinNew]-[dmgDMaxNew]. Charges: [chargesNew]. [ap] [apNew]. [rest] [restNew]. [rage] [rageNew]^[heal] [healOld]. [dam] [dmgDMinOld]-[dmgDMaxOld]. Charges: [chargesOld]. [ap] [apOld]. [rest] [restOld]. [rage] [rageOld]
lvu_gizmo_healing2_info=^int_spr_LvlUp_tAD^[healCap][heal] [healNew]. [dam] [dmgDMinNew]-[dmgDMaxNew]. Charges: [chargesNew]. [Init] +[initNew]. [rest] [restNew]. [rage] [rageNew]^[heal] [healOld]. [dam] [dmgDMinOld]-[dmgDMaxOld]. Charges: [chargesOld]. [Init] +[initOld]. [rest] [restOld]. [rage] [rageOld]
lvu_gizmo_healing3_info=^int_spr_LvlUp_tAD^[healCap][heal] [healNew]. [dam] [dmgDMinNew]-[dmgDMaxNew]. Charges: [chargesNew]. [ap] [apNew]. [rest] [restNew]. [rage] [rageNew]^[heal] [healOld]. [dam] [dmgDMinOld]-[dmgDMaxOld]. Charges: [chargesOld]. [ap] [apOld]. [initOld]. [rest] [restOld]. [rage] [rageOld]
lvu_gizmo_healing4_info=^int_spr_LvlUp_tAD^[healCap][heal] [healNew]. [dam] [dmgDMinNew]-[dmgDMaxNew]. Charges: [chargesNew]. [Init] +[initNew]. [rest] [restNew]. [rage] [rageNew]^[heal] [healOld]. [dam] [dmgDMinOld]-[dmgDMaxOld]. Charges: [chargesOld]. [Init] +[initOld]. [initOld]. [rest] [restOld]. [rage] [rageOld]
lvu_gizmo_rage1_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_gizmo_rage2_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_gizmo_rage3_info=^int_spr_LvlUp_tAD^[rageCap][rage] [rageNew]^[rage] [rageOld]
lvu_gizmo_rest1_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_gizmo_rest2_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_gizmo_rest3_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
lvu_gizmo_rest4_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
//lvu_gizmo_rest5_info=^int_spr_LvlUp_tAD^[restCap][rest] [restNew]^[rest] [restOld]
